##### 프로그래밍의 정석, 파이썬 - 실습 및 연습 문제 풀이
##### 1장 식
##### 작성자: 도경구 (확인 2020/12/05)

#### 1.1 문자열

### 실습 1.1 - 아스키 (p.22)

# 스스로

### 실습 1.2 - 유니코드 (p.23)

# 스스로

### 실습 1.3 - 구분문자의 탈바꿈 (p.27)

# 'She said, "I\'ve seen it before!"'
# "She said, \"I've seen it before!\""

### 실습 1.4 - 특수 문자 프린트 (p.29)

# Welcome to
# 	      the world of
# 	      computer science!

### 실습 1.5 - 아스키 아트 (p.31)

print('\
PPP       t  h\n\
P  P y y ttt hh   o  nn\n\
PPP   y   t  h h o o n n\n\
P    y    t  h h  o  n n\
')

#### 1.2 수식

### 실습 1.6 - 수식 계산 (p.39)

# 스스로

### 실습 1.7 - 지갑에 들어있는 현금 총액 계산 (p.39)

# 500 * 3 + 100 * 4 + 50 * 3 + 10 * 7

### 실습 1.8 - 2시간 45분은 몇 초? (p.39)

# (2 * 60 + 45) * 60

### 실습 1.9 - 333초는 몇 분 몇 초? (p.40)

# 333 // 60 # m
# 333 % 60  # s

### 실습 1.10 - 실수 계산 오차 사례 찾기 (p.43)

# 0.1 * 0.2
# 0.2 * 0.2

### 실습 1.11 - 타입 변환 이해 (p.46)

# 스스로

### 실습 1.12 - 100m 달리기 세계 기록을 시속으로 따지면? (p.47)

# int(100 / 9.58 * 60 * 60 / 1000) 
# # 계산 결과 = 37


##### 연습 문제

### 1.1 - 초고속 열차 시속 계산

# int(325 * 60 / 16)
# # 계산 결과 = 1218

### 1.2 - 마라톤 세계 기록의 초속 계산

# int(42.195 * 1000 / ((2 * 60 + 1) * 60 + 39))
# # 계산 결과 = 5

